
// ignore_for_file: unused_import

import 'dart:math';





List aliftext=["أ","ب","ت","ث","ج","ح","خ","د","ذ","ر","ز","س","ش","ص","ض","ط","ظ","ع","غ","ف","ق","ك","ل","م","ن","و","ه","ء","ى"];

List batext1=["ب","بـ","ـبـ","ت","تـ","ـتـ","ث","ثـ","ـثـ","ن","نـ","ـنـ","ى","يـ","ـيـ","ج","جـ","ـجـ","ح","حـ","ـحـ","خ","خـ","ـخـ","س","سـ","ـسـ","ش","شـ","ـشـ","ص","صـ","ـضـ","ض","ضـ","ـضـ","ع","عـ","ـعـ","غ","غـ","ـغـ","ف","فـ","ـفـ","ق","قـ",
"ـقـ","ك","كـ","ـكـ","ل","لـ","ـلـ","م","مـ","ـمـ","ه","هـ","ـهـ"];

List batext2=["بـ","جـ","فـ","صـ","مـ","هـ","كـ","شـ","عـ","لـ","ـبـ","ـغـ","كـ","قـ","سـ","حـ","تـ","ـمـ","ضـ","خـ","حـ","ـيـ","ثـ","هـ","ـهـ","ر","غـ","فـ","نـ","عـ"];

  List catext=["بأ","حب","حج","جد","مع","عص","ظل","بك","هو","له","حم","من","لأ","لح","حى","يس","كب","قؤ","هم","به","يه","ته","خر","خذ","صع","صغ","فج","يف","لو","جى"];

  List gimtext=["صلح","بصل","خلص","عنك","لعن","شفع","تجد","فتح","نعت","يصل","خبر","كسب","سعد","يسر","نفس","طلب","مطر","حبط","علم","بعد","شجع","قلم","عقل","علق","هلك","سهم","سفه","كنت","سكن","ضحك","يتلو","نعمت","جعان","لعلك","مقطع","ثقلت"];

  List hatext=["ينقب","تضليل","يتكلم","تمكلم","ممتحن","لفسقين","بنفعكم","يستيقن","للمتقين","نجعلهما","للعلمين","لنسلنهم","ليجمعنكم","ليستخلفنكم","مستضعفين"];
  List khatext=["اَ","بَ","تَ","ثَ","جَ","حَ","خَ","دَ","ذَ","رَ","زَ","سَ","شَ","صَ","ضَ","طَ","ظَ","عَ","غَ","ف","قَ","ل","مَ","نَ","وَ","ه","ءَ","ىَ","ي"];

   List daltext=["اِ","بِ","تِ","ثِ","جِ","حِ","خِ","دِ","ذِ","رِ","زِ","سِ","شِ","صِ","ضِ","طِ","ظِ","عِ","غِ","فِ","قِ","لِ","مِ","نِ","وِ","هِ","ءِ","ىِ","يِ"];

   List jaltext=["اُ","بُ","تُ","ثُ","جُ","حُ","خُ","دُ","ذُ","رُ","زُ","سُ","شُ","صُ","ضُ","طُ","ظُ","عُ","غُ","فُ","قُ","لُ","مُ","نُ","وُ","هُ","ءُ","ىُ","يُ"];

   List ratext=["بَ بَ","دَ دَ","نَ نَ","مَ مَ","دَدِ","نَ نِ","مَ مِ","فُ فُ","خَ لُ","هـُ وَ","هـِ ىَ","بِ كَ","بَعَ","مَعَ","لِيَ","كَتَبَ","نَزَلَ","رَفَعَ","اَذِنَ","بَخِلَ","سَمِعَ","حَمِدَ","مَرِصَ","خَشِعَ","كَبُرَ","فَهُوَ","قُتِلَ","ثَقُلَ","طُبِعَ","قُرِئَ"];

   List jatext=["اً","بًا","تًا","ثًا","جًا","خًا","حًا","دًا","ذًا","رًا","زًا","سًا","شًا","صًا","ضًا","طًا","ظًا","عًا","غًا","فًا","قًا","كًا","لًا","مًا","نًا","وًا","هًا","نًا","يًا"];
  
   List sintext=["اٍ","بٍ","تٍ","ثٍ","جٍ","حٍ","خٍ","دٍ","ذٍ","رٍ","زٍ","سٍ","شٍ","ص","ض","طٍ","ظٍ","عٍ","غٍ","فٍ","قٍ","كٍ","لٍ","مـٍ","نٍ","وٍ","هٍ","ىٍ","يـٍٍ"];
    
    List shintext=["بٌ","وٌ","فٌ","تٌ","طٌ","ثٌ","سٌ","صٌ","جٌ","ذٌ","زٌ","ظٌ","حٌ","هٌ","خٌ","دٌ","ضٌ","عٌ","ءٌ","اٌ","ىٌ","قٌ","كٌ","لٌ","مٌ","نٌ","رٌ","غٌ","يٌ"];
    
    List soyad=["بَعَ","بعًا","دَعٍ","اَبٌ","مَعًا","هُدًا","اَحَدَ","اَخَذَ","اَبَدًاٍ","جَسَدًاٍ","رَشَدًا","اَذِنَ","رَفَقًا","حَرَسًا","جَمَعَ","حَشَرَ","جَعَلَ","شَطَطًا","كَبَدٍ","عَلَقٍ","مَعَكَ","قَدَرِ","كَفَرَ","وَلَدَ","طَلَقٍ","لَهَبَ","مَسَدٍ","عَمَدٍ","جَهَرَ","سَرَقَ"];

     List doyadtext=["تٰ","ثٰ","جٰ","دٰ","ذٰ","زٰ","سٰ","شٰ","صٰ","ضٰ","طٰ","ظٰ","فٰ","قٰ","كٰ","اٰ","لٰ","حٰ","ىٖ","رٖ","مٖ","لٖ","وٖ","نٖ", "ءٗ","هٗ","حٗ","خٗ","عٗ","غٗ",];

List toyatext=["أَحَدٌ","صَمَدٌ","عَمِلَ","فَطَلرَ","ذَهَبٍ","كُتِبٌ","سُرُلرٌ","وَجَدَ","مُنِعَ","صُحُفٌ","شُهُبًا","كُفُوًا","لُبَدًا","طُوًى","ضُحًى","شُعَبٍ","ذُكِرَ","نُفِخَ","قَسَمٌ","حَطَبً","كَذِبًا","اَمَرَ","جَمَعَ","خُلِقَ","قُرِئ","حَسَنٍ","اَحَدٍ","رُسُلٌ","سَنَةٌ","تَبِعَ","سُوًى","مَطَرًا","عِنَبًا","صَعَدًا","لَعِبٌ","دُبُرٍ","غَبَرَةٌ","قَتَرَةَ","عَلَقَةٌ","دَرَجَةٌ","شَجَرَةٌ","سَمِعَةٌ","سَفَرَةٍ","لُمِزَةٍ","هُمَزَهٍ","كَلِمَةٌ","فَطِرَةٍ","رَقَبَةٍ","كَمَثَلٍ","بِقَرَرٍ","لِبَشَرٍ","بِرَجُلٍ","فَاَجَلٌ","فَنُزُلٌ","بِثَمَنٍ","فَصَرَفَ","فَبَدَأَ","بَرَرَةٍ","صَدَقَةٍ","فَرَحَةٌٍ"];


  List yayintext=["حَبْ","حَجْ","حَصْ","حَوْ","حَيْ","حَا","لَنْ","لَلْ","لَمْ","لَوْ","لَيْ","لأ","فَرْ","فَجْ","فَكْ","فَوْ","فَيْ","فَا","عَنْ","عَصْ","عَمْ","عَوْ","عَيْ","عَا","هَلْ","هَمْ","هَكْ","هَوْ","هَيْ","ها","اِنْ","اِلْ","اِجْ","اِشْ","اِوْ","اِىْ","بِسْ","بِرْ","بِفْ","بِأ","بِوْ","بِىْ","سِلْ","سِجْ","سِتْ","سِنْ","سِوْ","سِيْ","مِصْ","مِثْ","مِنْ","مِلْ","مِوْ","مِيْ","فِرْ","فِزْ","فِحْ","فأْ","فِوْ","فِيْ"];
   
   List yayintext2=["قُلْ","قُمْ","قُرْ","قُبْ","قُىْ","قُوْ","سُنْ","سُجْ","سُقْ","سُفْ","سُىْ","سُوْ","لُبْ","لُفْ","لُحْ","لُهْ","لُرْ","لُوْ","دُنْ","دُرْ","دُكْ","دُسْ","دُزْ","دُوْ","حُصْ","حُسْ","حُشْ","حُثْ","حُىْ","حُوْ"];

    List yayintext3=["بَلٰى","عَلٰى","كَفٰى","عَسٰى","يَرٰى","اٖلٰى","بِهٖ","لَهٗ","اٰوٰى","طغٰى","ذٰلِكَ","اَحْوٰى","تَرْضٰى","اَغْنٰى","يَخْشٰ","عِيْسٰ","مُوْسٰي","اَوْحٰى","يُتْلٰى","وُثْقٰى","وُسْطٰى","يُحْىٖ","يُغْنِ",];

    List zoyatext=["رِحِيقٍ","عِظِيْمٍٍ","أَمِيْنٍ","كَرِيْمٍ","ضَنِيْنٍ","رَحِيْمٍ","شُهُوْدٌ","قُعُوْدٌ","رَسُوْلٌ","شَهِيْدٌ","خَبِيْرٌ","مَجِيْدٌ","رَفَعْنَا","وَضَعْنَا","خَلَقْنَا","اَنْزَلْنَا","لَدَيْنَا",];

    List zoyatext2=["تَعْلَمُوْنَ","يَشْتَهُوْنَ","تُبْضِرُوْنَ","مُتْرَفِيْنَ","مَدِيْنِيْنَ","مُتَ"];

  List goyintext=["رَبَّ","صَبَّ","تَبَّ","عَدَّ","مَدَّ","حَقَّ","هَمَّ","عَمَّ","مَنَّ","ظَنَّ","اَنَّ","مَسَّ","سِرَّ","سِنَّ","اِنَّ","ثُمـَّ","كُنَّ","هُنَّ","قُدَّ","ثَمَّ","كُلُّ","مِتُّ","فِرُّ","اَيَّا","حَبًّا","حقًّا","صَفًّا","هَدًّا","اَزًّا","مَدًّا","حبًّا","حَقًّأ","صَفًّا","هَدًّا","اَزًّا","مَدًّا","بَرًّا","فَرًّا","رجَّا","بَسًّا","شَقًّا","غَيًّا","اَدًّا","ضِدَّا","عِزًّا","وُدًّا","حَجٍّ","شَكٍّ"];
   
   List fatext=["كَذَّبَ","عَدَّدَ","قَدَّرَ","نَعَّمَ","صَدَّقَ","حَلَّلَ","بُرِّزَ","حُصِّلَ","حُرِّمَ","زُيِّنَ","فُعِّلَ","رَبِّكَ","سَيِّدٌ","هَيِّنٌ","جَنّةٌ","دُرَّةٍ","كَرَّةٍ","قُوَّةٍ","قَدَّمَتْ","كَذَّبَتْ","فُجِِّرتْ","سَوَّالَتْ","تَأَخَّرَ","تَقَدَّمْ","حُرِّمَتْ","فُصِّلَتْ","سُيِّرَتْ","كُوِّرَتْ","زُوِّجَتْ","ذُلِّلَتْ","قَيِّمَةٌ","بَيِّنَةٌ","عَشِيَّةٌ","مُحَبَّةٌ","قُوَّةٌ","لَذَّةً","تَجَلاـ"];

   List koftext=["مُبَيَّنَةٌ","مُمَدَّدَةٍ","مُطَهَّرَةٍ","مُكَرَّمَةٍ","مُسَوَّمَةٍ","اَلْمُزَّمِّلُ","عِلِّيُّوْنَ","اُمَتِعْكُنَّ","لَيَقُولُنَّ","فَمَتِّعُوْهُنَّ","طَلَّقْتُمُوْهُنَّ","وَسَرِّحُوْهُنَّ","طَلَّقْتُمُوْهُنَّ","وَسَرِّحُوْهُنَّ","يَوْمَئِذٍ","يَصَّدَّعُوْنَ","شَرِالنَّفّٰثٰتِ","شَرًّايَّرَهٗ","وَعَلِمُوْا","الصّٰلِحٰتِ","لِيَعْبُدُواالّٰلهَ"];

  List allpage=[aliftext,batext1,batext2,catext,gimtext,hatext,khatext,daltext,jaltext,ratext,jatext,sintext,shintext,soyad,toyatext,yayintext,yayintext2,doyadtext,yayintext3,zoyatext,goyintext,zoyatext2,fatext,koftext];



